const 男 = {
  sex: 'm',
  key: '',
  stc: '',
  sn: 'default',
  sv: 1,
  p: 1,
  f: 'select',
  listStyle: 'bigPhoto',
  pri_uid: 200715830,
  jsversion: 'v5'
}
/* 23:1 有照片的意思 */
const 男北京 = {
  sex: 'm',
  key: '',
  stc: '1:11,23:1',
  sn: 'default',
  sv: 1,
  p: 1,
  f: 'select',
  listStyle: 'bigPhoto',
  pri_uid: 200715830,
  jsversion: 'v5'
}
const 广东空姐 = 'stc: 1:44,28:5'
const 广东白领 = 'stc: 1:44,28:1'
const 女北京 = {
  sex: 'f',
  key: '',
  stc: '1:11',
  sn: 'default',
  sv: 1,
  p: 1,
  f: 'select',
  listStyle: 'bigPhoto',
  pri_uid: 0,
  jsversion: 'v5'
}
/* 

stc : 地区 ：
天津：1:12
*/
const stc = {
  '所有地区': '',
  '北京': '1:11',
  '天津': '1:12',
  '天津和平': '1:1201',
  '河北': "1:13",
  '山西': "1:14",
  '内蒙古': "1:15",
  '辽宁': "1:21",
  '吉林': "1:22",
  '黑龙江': "1:23",
  '上海': "1:31",
  '江苏': "1:32",
  '浙江': "1:33",
  '安徽': "1:34",
  '福建': "1:35",
  '江西': "1:36",
  '山东': "1:37",
  '河南': "1:41",
  '湖北': "1:42",
  '湖南': "1:43",
  '广东': "1:44",
  '广西': "1:45",
  '海南': "1:46",
  '重庆': "1:50",
  '四川': "1:51",
  '贵州': "1:52",
  '云南': "1:53",
  '西藏': "1:54",
  '陕西': "1:61",
  '甘肃': "1:62",
  '青海': "1:63",
  '宁夏': "1:64",
  '新疆': "1:65",
  '台湾': "1:71",
  '香港': "1:81",
  '澳门': "1:82",
  '美国': "1:98",
  '国外': "1:99",
}

const 标签 = {
  '高级白领': "1",
  '教师': "2",
  '医务工作': "3",
  '银行职员': "4",
  '空姐': "5",
  '公务员': "6",
  '会计': "7",
  '在校学生': "8",
  '私营业主': "9"
}