const 男 = {
  sex: 'm',
  key: '',
  stc: '',
  sn: 'default',
  sv: 1,
  p: 1,
  f: 'select',
  listStyle: 'bigPhoto',
  pri_uid: 200715830,
  jsversion: 'v5'
}
const 男北京 = {
  sex: 'm',
  key: '',
  stc: '1:11',
  sn: 'default',
  sv: 1,
  p: 1,
  f: 'select',
  listStyle: 'bigPhoto',
  pri_uid: 200715830,
  jsversion: 'v5'
}
const 女北京 = {
  sex: 'f',
  key: '',
  stc: '1:11',
  sn: 'default',
  sv: 1,
  p: 1,
  f: 'select',
  listStyle: 'bigPhoto',
  pri_uid: 200715830,
  jsversion: 'v5'
}
/* 

stc : 地区 ：
天津：1:12
*/
const stc = {
  '所有地区': '',
  '北京': '1:11',
  '天津': '1:12',
  '天津和平': '1:1201',
  '河北': '1:13'
'北京':"11"
'天津':"12"
'河北':"13"
'山西':"14"
'内蒙':
'辽宁':
'吉林':
'黑龙:
'上海':
'江苏':
'浙江':
'安徽':
'福建':
'江西':
'山东':
'河南':
'湖北':
'湖南':
'广东':
'广西':
'海南':
'重庆':
'四川':
'贵州':
'云南':
'西藏':
'陕西':
'甘肃':
'青海':
'宁夏':
'新疆':
'台湾':
'香港':
'澳门':
'美国':
'国外':
}




"15"
"21"
"22"
"23"
"31"
"32"
"33"
"34"
"35"
"36"
"37"
"41"
"42"
"43"
"44"
"45"
"46"
"50"
"51"
"52"
"53"
"54"
"61"
"62"
"63"
"64"
"65"
"71"
"81"
"82"
"98"
"99"
