import detailModel from '../model/details'
import Base from './basePrototype'
import allGirlModel from '../model/allgirls'
import AdminModel from "../model/admins"
import ipPoolModel from '../model/ippools'
import formidable from 'formidable'
import { stc } from "../core/config"
const fs = require('fs')

class Common extends Base {
  constructor() {
    super()
  }
  /**
   * 获取统计数
   * @param {*} req 
   * @param {*} res 
   * @param {*} next 
   */
  async getLine(req, res, next) {
    try {
     

      const m = ['丧偶', '离异', '未婚']
      const marriagePeo = []
      for (const val of m) {
        const people = await allGirlModel.count({ marriage: val })
        marriagePeo.push({marriage: val, count: people})
      }
      /* 
      统计出人数对象{date, count,}
      86400 000
      new Date('2019-04-01').getTime()
      new Date('2020-01-03').getTime()
      */
      const Province = Object.keys(stc)
      const provicePeople = []
      for (const val of Province) {
        const people = await allGirlModel.count({ area: val })
        provicePeople.push({province: val, count: people})
      }
      const dayMil = 86400000
      const startDayMil = new Date('2019-04-01').getTime()
      const dayCount = (new Date('2020-01-03').getTime() - new Date('2019-04-01').getTime()) / dayMil
      const LineArr = []
      for (let i = 0; i < dayCount; i++) {
        const curDay = startDayMil + i * dayMil
        const curDayCount = await allGirlModel.count({ createTime: { $gt: startDayMil + i * dayMil, $lt: startDayMil + (i+1)*dayMil } })
        LineArr.push({date: new Date(curDay).toLocaleDateString(), count: curDayCount})
      }
      console.log(LineArr)
      res.send({
        status: 200,
        data: {
          LineCount: LineArr,
          stc: Province,
          provicePeopleCount: provicePeople
        }
      })
    } catch (error) {
      res.send({
        status: 400,
        message: `获取失败,失败原因:${error}`
      })
    }
  }
  /**
   * 获取混应状况
   * @param {*} req 
   * @param {*} res 
   * @param {*} next 
   */
  async getMarriage(req, res, next) {
    try {
      const m = ['丧偶', '离异', '未婚']
      const marriagePeo = []
      for (const val of m) {
        const people = await allGirlModel.count({ marriage: val })
        marriagePeo.push({marriage: val, count: people})
      }
      res.send({
        status: 200,
        data: {
          marriagePeo
        }
      })
    } catch (error) {
      res.send({
        status: 400,
        message: `获取失败,失败原因:${error}`
      })
    }
  }

  async getWords(req, res, next) {
    try {
      console.log('o');
      // const data = await allGirlModel.find({}, { shortnote: 1, _id: 0 }).skip(5000).limit(5000)
      // let str = ''
      // data.forEach(v => {
      //   str+=v.shortnote
      // })
      const arr = ["有趣", "的", "灵魂", "会", "相逢", "在", "高处", "希望", "和", "一个", "温暖", "及", "有趣", "的", "人", "相遇", "遇到", "你", "之前", "所有", "的", "条件", "都", "只是", "也", "仅仅只是", "预设", "而已", "一直", "未婚", "会", "有人", "有", "疑问", "我", "只能", "回答", "我爱过", "但", "没婚", "过", "性格", "无", "硬伤", "生活", "也", "没什", "注册", "佳缘", "有", "几年", "了", "貌似", "玩", "这个", "软件", "的", "真诚", "找对象", "交友", "的", "并不多", "上来", "就是", "些", "个", "要", "加微信", "的", "真诚", "交友", "非诚", "勿扰", "首先", "介绍", "一下", "自己", "小女子", "是", "外表", "比较", "高冷", "内心", "狂热", "思想单纯", "的", "人", "属", "腼腆", "被动型", "所以", "千万", "不要", "被", "我", "高", "冷", "的", "外表", "吓跑", "了", "一定", "要花", "时间", "多", "了解", "下", "我", "^_^", "择偶", "标准", "：", "好", "相处", "合眼", "缘", "性格", "好", "固定", "我", "在", "一家", "国有", "控股", "的", "上市公司", "做", "技术", "管理工作", "工作", "性质", "属于", "朝九晚五", "平时", "生活", "工作", "认真", "严谨", "有", "规律", "性格", "温婉", "属于", "内敛", "型", "的", "女子", "喜欢", "爬山", "旅游", "上网", "我", "出生", "在", "一个", "普通", "的", "国企", "职员", "家愿", "得", "一", "人心", "白首", "不相离", "执子之手", "与子偕老", "你好", "吖", "以下", "是", "我", "的", "信息", "我", "的", "基本", "：", "1996", "年", "1", "月", "17", "日", "出生", "23", "岁", "身高", "163", "体重", "47", "性格", "活泼开朗", "乐观", "积极", "现居", "广州", "家", "在", "梅州", "家庭", "条件", "中等", "我", "的", "经济", "：", "目前", "收入", "8", "从事", "销售", "行", "我", "是", "一个", "土生土长", "的", "东莞", "人", "要求", "自己", "的", "另一半", "也", "本地人", "我", "的", "他", "不", "需要", "帅", "只要", "人", "看起来", "干净", "我", "的", "他", "不", "需要", "非常", "有钱", "只要", "肯", "努力", "工作", "对", "自己", "有", "相信", "我", "的", "他", "不", "需要", "有", "多", "高", "只", "需要", "有", "比", "我高", "（", "本人", "166", "我", "喜欢", "唱歌", "喜欢", "享受", "工作", "带来", "的", "快乐", "我", "在", "业余时间", "最大", "的", "消遣", "是", "看书", "听", "音乐", "我", "憧憬", "的", "生活", "是", "简单", "快乐", "舒适", "我", "希望", "我", "未来", "的", "另一半", "最好", "是", "正直", "善良", "聪明能干", "有", "责任心", "有", "一定", "经", "为了", "了", "却", "父母", "的", "心愿", "为了", "找到", "适合", "自己", "的", "另一半", "便", "来到", "了", "世纪", "佳缘", "寻找", "属于", "我", "的", "真爱", "只是", "想", "玩玩", "而", "没", "诚意", "者", "不要", "随便", "打听", "我", "时间", "宝贵", "好", "喜欢", "山涧", "的", "泉水", "叮叮", "咚咚", "欢快", "的", "流淌", "着", "那么", "纯洁", "透明", "首先", "更正", "一点", "学历", "是", "硕士", "（", "全日制", "）", "我", "是", "工作", "十年", "后", "通过", "了", "全国", "硕士", "研究生", "统一", "考试", "再", "去", "读研", "的", "2016", "年", "7", "月", "硕", "我", "的", "感情", "经历", "很", "简单", "所以", "不想", "找个", "太", "复杂", "的", "人", "所以", "离异", "带娃", "的", "不要", "给", "我", "写信", "了", "我会", "是", "个", "贤妻良母", "但", "我", "一点", "都", "不想", "当", "后妈", "谢谢", "大家", "的", "关注", "单身", "了", "几年", "不要", "问", "为什么", "因为", "不想", "借助", "这个", "平台", "但愿", "找到", "位", "陪伴", "彼此", "终身", "的", "人", "我", "已经", "到", "了", "谈婚论嫁", "的", "年龄", "没空", "和", "你", "玩", "爱情", "游戏", "如有", "欺骗", "欺诈", "行为", "将", "追究", "一切", "非诚", "勿扰", "属", "虎", "和", "猪", "请", "勿扰", "我", "属", "猴", "和", "属", "老鼠", "蛇龙", "比较", "般", "我", "的", "人生", "感言", ";", "如果", "上帝", "只", "赐予", "我", "美貌", ",", "才智", "而", "让", "我", "找", "不到", "我", "人生", "的", "另一半", "我", "宁愿", "放弃", "美貌", "才智", "如果", "菩萨", "保佑", "我能", "活上", "一百多岁", "却", "让", "我", "孤独", "一生", "我", "情愿", "拥有", "真爱", "对方", "活", "一天", "寻", "不到", "你", "我", "岂能", "躇", "足天", "青色", "等", "烟雨", "而", "我", "在", "等", "你", "炊烟袅袅", "升起", "隔江", "千万里", "在", "瓶底", "书", "汉隶", "仿", "前朝", "的", "飘逸", "就", "当", "我", "为", "遇见", "你", "伏笔", "月色", "被", "打捞", "起晕", "90", "年", "出生", "处女座", "生活", "中是", "位", "开朗", "搞笑", "的", "女", "青年", "性格", "动中", "有静", "特别", "喜欢", "大自然", "非诚", "勿扰", "诚", "很", "重要", "谢谢", "每", "一颗", "诚意", "的", "心", "我", "亦", "只有", "一个", "一生", "不能", "慷慨", "赠与", "不爱", "我", "之", "人", "看见", "我", "你", "会", "有", "什么", "感觉", "呢", "(*^__^*)", "感谢", "你", "的", "阅读", "我", "的", "资料", "简单", "自我介绍", "一下", "希望", "你", "能", "静静地", "浏览", "我", "的", "资料", "打开", "彼此", "的", "内心世界", "家庭", "：", "我", "在", "大家", "好", "首先", "感謝", "那些", "瀏覽過", "我", "資料", "寫過", "信件", "給我", "的", "人", "因為", "我", "不是", "會員", "所以", "有些", "信件", "我", "看", "不了", "也", "回", "復", "不了", "在", "這裡", "我", "表示歉意", "!", "先介紹", "下", "自己", "吧", "甘肅", "定西", "人", "目前", "在", "深圳", "從事", "銷售", "工作", "不算", "高", "闺女", "我", "有", "男性", "的", "朋友", "无", "男友", "家中", "1", "男", "3", "女", "大哥", "84", "年", "大姐", "87", "年", "2", "姐", "89", "年", "爸妈", "恩恩爱爱", "家教", "是", "：", "宁缺毋滥", "不为", "结婚", "而", "结婚", "没有", "结婚", "压力", "姑娘", "我", "看", "得到", "来信", "一定", "回信", "我出", "生于", "一个", "知识分子", "家庭", "父母", "都", "是", "工程师", "简单", "的", "三口", "之家", "家庭和睦", "本人", "大学毕业", "后", "一直", "在", "广州", "的", "一个", "事业单位", "工作", "至今", "感情", "经历", "简单", "希望", "遇见", "背景", "相仿", "的", "你", "这里", "的", "照片", "皆", "为", "近期", "拍摄", "我", "是", "硕士", "毕业", "刚刚", "来到", "深圳", "工作", "的", "以后", "会", "定居", "在", "这里", "我", "希望", "找", "一个", "稳重", "成熟", "感情", "专一", "身高", "175", "以上学历", "不能", "低于", "本科", "以上", "不", "吸烟", "善良", "孝顺", "有", "事业心", "有", "责任感", "的", "男士", "(", "注", ":", "泡网吧", "夜店", "进入", "了", "2018", "年", "我", "又", "成熟", "了", "一岁", "我", "不", "认为", "自己", "老", "了", "所以", "只是", "定义", "自己", "成熟", "了", "一岁", "而已", "在", "新", "的", "一年", "里", "祝", "自己", "身体健康", "尽快", "找到", "一个", "能够", "互相照顾", "的", "伴侣", "本人", "性格开朗", "活泼", "在", "国企", "从", "我", "在", "福田区", "一", "学校", "教书", "因", "工作", "关系", "接触", "范围", "很窄", "平生", "心愿", ":", "愿得", "一心", "人", "白头", "不相离", "执子之手", "与子偕老", "希望", "能", "与", "相爱", "的", "人", "有", "一个", "温暖", "幸福", "的", "家", "这", "一生", "只是", "想", "让", "自己", "属于", "一直", "在", "等待", "等", "着", "那个", "和", "我", "终生", "相伴", "相爱", "的", "你", "出现", "我", "在", "等", "你", "当前", "社会", "问题", "很多", "如果", "您", "喜欢", "朝三暮四", "请", "不要", "找", "我", "望", "理解", "网络", "的", "优势", "在于", "它", "即时性", "但", "的确", "不", "稳定", "所以", "希望", "大家", "都", "能", "去", "寻找", "彼此", "稳定", "的", "爱", "很多", "东西", "努力", "去", "追逐", "却", "又", "得不到", "不过", "我", "较", "看重", "对方", "的", "人品", "责任心", "专一", "内涵", "修养", "谈吐", "学历", "和", "身高", "想象", "是", "美好", "现实", "没有", "完美", "的", "如果", "遇到", "了", "那", "真是", "三生有幸", "主要", "还", "需多", "了解", "戴着", "面具", "的", "假", "绅士", "请", "勿扰", "谢谢", "幸福", "的", "关键", "不", "在于", "找到", "一个", "完美", "的", "人", "而", "在于", "找到", "一个", "人", "然后", "和", "他", "一起", "努力", "建立", "一个", "完美", "的", "关系", "我", "不是", "仙女", "而且", "还会", "有", "很多", "缺点", "平时", "生活", "中", "的", "我", "性格", "比较", "开朗", "随和", "本人", "在", "深圳", "坂田", "工作", "32", "岁", "已", "购房", "父亲", "是", "公务员", "母亲", "是", "工人", "父母", "都", "有", "退休金", "想", "找", "一个", "祖籍", "是", "两广", "地区", "靠", "谱", "的", "男人", "结婚", "本人", "资料", "属实", "照片", "都", "是", "2019", "年", "拍", "的", "我", "喜欢", "感情", "专一", "的", "因为", "只", "我", "喜欢", "阳光", "外向", "开朗", "美貌", "与", "智慧", "拼存", "的", "男人", "热爱生活", "努力", "工作", "善待", "家人", "永远", "相信", "爱笑", "的", "女孩", "运气", "好", "注册", "世纪", "佳缘", "一段时间", "了", "一直", "都", "不", "太", "相信", "网络线", "上", "也", "是因为", "工作", "有点", "小忙", "所以", "很少", "上来", "一直", "也", "没有", "完善", "资料", "最近", "身边", "一些", "同学", "朋友", "通过", "这个", "平台", "找到", "了", "人生", "伴侣", "力荐", "我", "上", "这个", "平台", "找", "找", "简单", "爱情", "有", "可能", "是", "一杯", "苦酒", "甚至于", "毒酒", "但", "仍然", "人人", "还是", "要", "去", "尝试", "也许", "是", "爱情", "的", "力量", "但", "我", "也", "不", "例外", "虽然", "这个", "平台", "优秀", "男人", "之多有", "眼缘", "的", "也", "不少", "适合", "自己", "的", "少之又少", "无止境", "的", "网聊", "和", "讲解", "让", "人", "疲惫", "不", "❤", "️", "独身", "几十年", "也", "是", "一种", "境界", "独身", "也", "要", "好好", "的", "生活", "没什么", "大不了", "一个", "人", "独身", "习惯", "了", "就", "习惯", "了", "一个", "人", "我", "是", "一个", "没有", "安全感", "的", "人", "所以", "有", "小孩", "的", "先生", "不要", "给", "我", "发信", "了", "我", "内心", "不够", "强大", "没有", "那个", "肚", "学历", "大专", "来到", "佳缘", "有", "一段时间", "了", ",", "却", "总是", "带", "着", "希望", "而来", ",", "失望", "而", "归", "!", "有", "很多", "时候", "都", "想", "放弃", "了", ",", "但", "每次", "真正", "想要", "放弃", "的", "时候", "都", "想着", "再", "等等", "吧", ",", "也许", "缘分", "就", "在", "不远处", "!", "所以", "便", "又", "带", "着", "最后", "一丝", "我", "很", "普通", "即", "不", "漂亮", "也", "不", "美丽", "只是", "有", "一点点", "气质", "放在", "人群", "里", "可能", "会", "找", "不到", "我", "第一面", "的", "感觉", "很", "重要", "能", "喜欢", "才", "会", "爱", "有", "爱", "才", "会", "珍惜", "懂得", "珍惜", "的", "人才", "会", "有", "责任", "有", "责任", ",,,,,,,!", "我", "是", "只", "小小鸟", ",", "想要", "飞", "却", "怎么", "也", "飞不高", "!", "蓦然回首", ",", "多少", "美好", "的", "人和事", "已", "在", "不经意", "间", "与", "我们", "擦肩而过", ",", "误经", "了", "许多", "驿站", ",", "感受", "过", "无数次", "失败", "才", "发现自己", "原来", "只是", "一个", "平凡", "的", "女子", ",", "要", "的", "无非", "是", "一个", "关爱", "自己", "的", "照片", "是", "本人", "不是", "骗子", "不是", "托", "希望", "认真", "交往", "半年", "到", "一年", "结婚", "注", "：", "1", "异地", "恋", "姐弟恋", "都", "不", "考虑", "2", "想", "约", "炮", "的", "和", "找", "备胎", "的", "准备", "爱情", "长跑", "的", "都", "不要", "来信", "了", "3", "加微信", "不", "说话", "不", "千山万水", "独孤", "行", "花开花落", "任", "飘零", "千金", "易得", "情难求", "何日", "君来", "伴", "我吟", "蓦然回首", "心", "戚戚", "有缘", "的", "他", "你", "在", "哪", "在", "熟人", "眼里", "我", "是", "个", "善良", "温柔", "美丽", "的", "贤妻良母", "型", "女孩", "在", "男生", "眼里", "我", "是", "那种", "80", "％", "会", "喜欢", "20", "％", "也", "不会", "讨厌", "的", "女生", "只", "可惜", "自己", "属于", "晚熟", "型", "品种", "又", "兼具", "追", "时间", "过", "了", "等待", "的", "心", "也", "累", "了", "一切", "随缘", "我", "喜欢", "逛街", "旅游", "我", "在", "业余时间", "最大", "的", "消遣", "是", "购物", "我", "憧憬", "的", "生活", "是", "简单", "就", "好", "关键", "是", "两", "人心", "心", "相映", "我", "希望", "我", "未来", "的", "另一半", "最好", "是", "稳重", "顾家", "乐观", "积极", "真心", "希望", "在", "这里", "能", "遇到", "我", "的", "那个", "!", "（", "没有", "真正", "能", "限制", "爱情", "的", "方法", "：", "就是", "彻底", "拿掉", "限制", "让", "对方", "海阔天空", "而", "你", "相信", "自己", "本身", "就", "具有", "强大", "的", "吸引力", "你", "的", "爱", "你", "的", "才华", "你", "的", "宽容", "都", "是", "让", "对方", "离不开", "的", "原因", "生活", "在", "车水马龙", "的", "现代", "社会", "里", "快节奏", "的", "工作", "生活", "熙熙攘攘", "的", "人际关系", "迅速", "便捷", "的", "交流", "通道", "沟通", "却", "似乎", "有", "更", "多", "隔阂", "那", "曾经", "舍得", "花上", "几年", "时间", "等待", "回应", "的", "心", "如今", "裹", "在", "层层", "壁垒", "学会", "了", "快速", "修复", "自愈", "简单", "的", "文字", "当然", "不足以", "了解", "一个", "人", "读懂", "一个", "人", "那", "需要", "怎样", "的", "默契", "呢", "想", "找到", "这样", "一个", "人", "彼此", "相互了解", "心与心", "的", "交流", "最", "重要"].concat(["希望", "借此", "平台", "找到", "真诚", "的", "你", "牵手", "到", "老", "相濡以", "沬", "我", "是", "广东", "人", "我", "是", "一个", "文静", ",", "正直", ",", "细心", ",", "简单", ",", "乐观", "的", "人", "关于", "外貌", "简单", "形容", "就是", "皮肤", "白皙", ",", "大", "眼睛", "我", "现在", "的", "生活", "状态", "和", "心情", "可以", "说是", "“", "静", "待", "缘分", ",", "努力", "挣钱", "”", "30", "岁", "以下", "的", "男人", "请", "不要", "打扰", "我", "我", "是", "一个", "独立", ",", "孝顺", ",", "简单", ",", "顾家", "的", "人", "希望", "在", "这", "平台", "与", "有缘", "的", "你", "牵手", "走", "下去", "非诚", "勿扰", "谢谢", "生命", "中", "只有", "单纯", "的", "企盼", "找", "一个", "会", "在", "钱包", "里", "放", "我", "照片", "的", "男人", "敢", "让", "我", "咬", "在", "身上", "留", "印记", "的", "男人", "敢", "在", "微博", "博客", "写", "我", "的", "男人", "敢", "让", "我", "知道", "他", "一切", "的", "男人", "就算", "在", "我", "任性", "说", "分手", "的", "时候", "也", "不会", "抛下", "我会", "紧紧", "拥抱", "我", "不让", "我", "走", "的", "男人", "敢", "对", "我", "我", "的", "业余时间", "都", "放在", "了", "听", "音乐", "上", "我", "期待", "与", "你", "一起", "走过", "这段", "人生", "的", "历程", "一起", "分享", "生活", "的", "酸甜", "苦涩", "谢谢", "同学", "帮忙", "注册", "来到", "这个", "平台", "望能", "在", "这", "遇见", "一位", "有", "孝心", "有", "责任", "担当", "性格", "温和", "稳重", "型", "的", "男士", "为伴", "一起", "慢慢", "变老", "（", "女儿", "己", "成家", "了", "）", "对不起", "我", "是", "61", "年", "出生", "的", "我", "没有", "邮票", "不能", "给", "你", "回信", "我", "是", "一个", "顾家", ",", "爱家", "的", "小", "女人", "喜欢", "闲时", "听听", "音乐", "喜欢", "美食", "关于", "外貌", "简单", "形容", "就是", "不算", "漂亮", "但", "很", "有", "个", "性能", "下得", "厨房", "出得", "厅堂", "还有", "能", "我", "希望", "能", "找", "一个", "有", "能力", "照顾", "我们", "娘俩", "的", "人", "给", "我", "一", "我", "喜欢", "听歌", "旅游", "我", "在", "业余时间", "最大", "的", "消遣", "是", "上网", "喝茶", "我", "憧憬", "的", "生活", "是", "能", "和", "未来", "的", "你", "白头偕老", "我", "希望", "我", "未来", "的", "另一半", "最好", "是", "体贴", "性格", "好", "真心", "希望", "在", "这里", "能", "遇到", "我", "的", "那个", "!", "只想", "寻一", "伴侣", "出门", "可以", "一起", "云游", "四海", "入屋", "可以", "在", "小", "院子", "里", "沐浴", "阳光", "共享", "美食", "伺弄", "花草", "赋闲", "养生", "本人", "属", "猴", "1968", "年", "出生", "以此为准", "所有", "照片", "都", "是", "2017", "旅途", "所", "拍希", "一家人", "在", "一起", "吃吃饭", "聊聊天", "谈谈心", "你", "羡慕", "这种", "家", "的", "感觉", "吗", "我", "很", "羡慕", "希望", "借", "这个", "平台", "能够", "找到", "一个", "重", "感情", "专一", "孝顺", "老人", "的", "另一半", "婚姻", "我", "希望", "一定", "是", "以", "爱情", "为", "基础", "真诚", "的", "以", "结婚", "为", "目的", "生活", "中", "我", "很", "开朗", "可爱", "喜欢", "游玩", "一直", "向往", "平安", "和谐", "的", "生活", "心中", "的", "他", "也许", "是", "高知", "珍爱", "家庭", "这", "样子", "的", "我", "期待", "与", "你", "一起", "走过", "这段", "人生", "的", "历程", "一起", "分享", "生活", "的", "酸甜", "苦涩", "我", "没有", "闭月羞花", "的", "容颜", "但", "我", "有", "温柔", "的", "性格", "小资", "的", "情调", "希望", "与", "你", "在", "平淡", "的", "生活", "中", "一起", "弹奏", "锅碗瓢盆", "交响曲", "在", "星空", "下", "十指", "相扣", "漫步", "的", "人生", "缘分", "很暖", "：", "遇见", "很美", "：", "让", "我们", "默默地", "珍惜", "生命", "中", "的", "缘分", "静静的", "珍藏", "记忆", "中", "的", "美好", "刚", "注册", "的", "新会员", "只能", "看到", "免费", "的", "信件", "谢谢", "我", "是", "一个", "正直", ",", "顾家", ",", "温柔", "的", "人", "本人", "是", "江西", "南昌人", "随着", "孩子", "在", "深圳", "住"])

console.log(new Set(arr));

const set = [...new Set(arr)]
const ar = []
set.forEach(v => {
  const cur = v
  let count =0
  arr.forEach(V => {
    if (cur === V) {
    count +=1
  }
  })
  //TODO: SET,SPLIT,WORDJIEBA
  // if (cur.length > 1) {
    ar.push({word: cur, count})
  // }
})
console.log(ar);
      res.send({
        data: {
          // str: str.replace(/[、…！？。，.a-zA-Z]/g, '').replace(/\s+/g, ''),
          ar
        }
      })
     
    } catch (error) {
      res.send({
        status: 400,
        message: `获取失败,失败原因:${error}`
      })
    }
  }
}

export default new Common()